src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/lagrangian/reactingParcelFoam/cylinder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|G)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0.1;
    }

    "(rho|G)Final"
    {
        $rho;
        tolerance       1e-05;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       0;
        relTol          0.1;
        maxIter         50;
    }

    UFinal
    {
        $U;
        relTol          0;
        tolerance       1e-05;
    }

    "(k|epsilon)"
    {
        $UFinal;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       0;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-06;
        relTol          0;
    }

    "(h|Yi|O2|N2|H2O)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }

    hFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
    pRefCell        0;
    pRefValue       1e5;
}

relaxationFactors
{
    equations
    {
        ".*Final"       1;
    }
}


// ************************************************************************* //
